Tekla Open API Reference for Tekla Structures 2025
GridLineAttributes Properties
The GridLine.GridLineAttributes type exposes the following members.
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
DrawOnlyTextLabelsNotGridLines
 Set as true if you don't want to draw the grid lines, only show the grid lines' text labels.
DrawTextAtEndOfGridLine
 Set as true if you want to show the grid line's text label at the end of the line.
DrawTextAtStartOfGridLine
 Set as true if you want to show the grid line's text label at the start of the line.
Font
 The grid line's font attributes.
Frame
 The frame attributes of the grid line's label.
Line
 The grid line's line attributes.
OffsetAtEndOfLine
 The offset for the end of the grid line.
OffsetAtStartOfLine
 The offset for the beginning of the grid line.
Top
See Also
Reference
GridLine.GridLineAttributes Class
Tekla.Structures.Drawing Namespace